In [126]:
people = {'first': ['Corey', 'Jane', 'John'],
          'last': ['', 'Doe', 'Doe'],
           'email': ['corey@gmail.com', 'jane@gmail.com', 'john@gmail.com']
         }

In [127]:
import pandas as pd

In [128]:
df = pd.DataFrame(people)

In [129]:
df['last']

0
1    Doe
2    Doe
Name: last, dtype: object

In [130]:
df['last'].replace({'': 'boeie'})

0    boeie
1      Doe
2      Doe
Name: last, dtype: object

In [131]:
df['last'] = df['last'].replace({'': 'boeie'})

In [132]:
df

   first   last            email
0  Corey  boeie  corey@gmail.com
1   Jane    Doe   jane@gmail.com
2   John    Doe   john@gmail.com

In [133]:
df['fulll_name'] = df['first'] + ' ' + df['last']

In [134]:
df

   first   last            email   fulll_name
0  Corey  boeie  corey@gmail.com  Corey boeie
1   Jane    Doe   jane@gmail.com     Jane Doe
2   John    Doe   john@gmail.com     John Doe

In [135]:
df.drop(columns=['first', 'last'], inplace=True)

In [136]:
people2 = {'first': ['Tony', 'Steve'],
          'last': ['Start', 'Rogers'],
           'email': ['toney@gmail.com', 'cap@gmail.com']
         }

In [137]:
df2 = pd.DataFrame(people2)

In [138]:
df = df.append(df2, ignore_index=True)

In [142]:
filt = df['last'] == 'Doe'

In [143]:
df.drop(index=df[filt].index)

             email first   fulll_name    last
0  corey@gmail.com   NaN  Corey boeie     NaN
1   jane@gmail.com   NaN     Jane Doe     NaN
2   john@gmail.com   NaN     John Doe     NaN
3  toney@gmail.com   NaN          NaN     NaN
4    cap@gmail.com   NaN          NaN  Rogers

In [144]:
# turtorial 9

In [145]:
import pandas as pd
import numpy as np
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [146]:
df = pd.DataFrame(people)

In [147]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [160]:
# remove rows that lack certain values np.nan or No|ne
df.dropna()

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [156]:
df.dropna(axis='index', how='any')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [161]:
df.dropna(axis='index', how='all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [162]:
df.dropna(axis='index', how='any', subset=['email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [164]:
df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [165]:
df.dropna(axis='index', how='any', subset=['email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
5   None      NaN      Anonymous@email.com  None

In [166]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [167]:
df.fillna('MISSING')

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Anonymous@email.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [171]:
df['age'] = df['age'].astype(float)

In [173]:
df['age'].mean()

46.75